#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fer1035/aws01/runs/run-ef495PU1Nj6JAasy

Waiting for the plan to start...

Terraform v1.1.6
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.security_demo.aws_api_gateway_rest_api.api: Refreshing state... [id=e3vh22gyhl]
module.security_demo.aws_api_gateway_method.options: Refreshing state... [id=agm-e3vh22gyhl-08263f8zuc-OPTIONS]
module.endpoint_01.aws_iam_role.iam_for_lambda: Refreshing state... [id=tf_lambda_role]
module.security_demo.aws_api_gateway_usage_plan.usage_plan: Refreshing state... [id=9zgd89]
module.security_demo.aws_api_gateway_method_settings.all: Refreshing state... [id=e3vh22gyhl-test-*/*]
module.endpoint_01.aws_api_gateway_method.method: Refreshing state... [id=agm-e3vh22gyhl-jdhc55-POST]
module.endpoint_01.aws_api_gateway_model.model: Refreshing state... [id=qwfsgs]
module.security_demo.aws_api_gateway_api_key.api_key: Refreshing state... [id=vo9krzvmif]
module.endpoint_01.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-e3vh22gyhl-jdhc55-OPTIONS-200]
module.endpoint_01.aws_api_gateway_method.options: Refreshing state... [id=agm-e3vh22gyhl-jdhc55-OPTIONS]
module.security_demo.aws_api_gateway_integration.options: Refreshing state... [id=agi-e3vh22gyhl-08263f8zuc-OPTIONS]
module.security_demo.aws_wafv2_web_acl_association.waf_association: Refreshing state... [id=arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL_Regional/3d32b9d4-53a4-431a-b6af-53ae33d291dd,arn:aws:apigateway:us-east-1::/restapis/e3vh22gyhl/stages/test]
module.security_demo.aws_api_gateway_deployment.deployment: Refreshing state... [id=jtgcfv]
module.security_demo.aws_api_gateway_usage_plan_key.plan_key: Refreshing state... [id=vo9krzvmif]
module.endpoint_01.aws_api_gateway_method_response.response_200: Refreshing state... [id=agmr-e3vh22gyhl-jdhc55-POST-200]
module.security_demo.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-e3vh22gyhl-08263f8zuc-OPTIONS-200]
module.endpoint_01.aws_api_gateway_integration.integration: Refreshing state... [id=agi-e3vh22gyhl-jdhc55-POST]
module.endpoint_01.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-e3vh22gyhl-jdhc55-OPTIONS-200]
module.endpoint_01.aws_api_gateway_resource.resource: Refreshing state... [id=jdhc55]
module.security_demo.aws_api_gateway_request_validator.validator: Refreshing state... [id=h6gjmy]
module.endpoint_01.aws_api_gateway_integration.options: Refreshing state... [id=agi-e3vh22gyhl-jdhc55-OPTIONS]
module.endpoint_01.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.endpoint_01.aws_lambda_function.function: Refreshing state... [id=tf_lambda]
module.security_demo.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-e3vh22gyhl-08263f8zuc-OPTIONS-200]
module.ansible.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:531133914787:cluster/ansible]
module.ansible.aws_iam_role.role: Refreshing state... [id=ansible_role]
module.security_demo.aws_wafv2_web_acl.waf_regional: Refreshing state... [id=3d32b9d4-53a4-431a-b6af-53ae33d291dd]
module.ansible.aws_ecs_task_definition.task: Refreshing state... [id=ansible]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.ansible.aws_ecs_cluster.cluster has changed
  ~ resource "aws_ecs_cluster" "cluster" {
        id                 = "arn:aws:ecs:us-east-1:531133914787:cluster/ansible"
        name               = "ansible"
      + tags               = {}
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ansible.aws_ecs_task_definition.task has changed
  ~ resource "aws_ecs_task_definition" "task" {
        id                       = "ansible"
      + tags                     = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ansible.aws_iam_role.role has changed
  ~ resource "aws_iam_role" "role" {
        id                    = "ansible_role"
        name                  = "ansible_role"
      + tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ansible.aws_ecr_lifecycle_policy.lifecycle will be created
  + resource "aws_ecr_lifecycle_policy" "lifecycle" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire untagged images after 1 day"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "ansible"
    }

  # module.ansible.aws_ecr_repository.repository will be created
  + resource "aws_ecr_repository" "repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "ansible"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.ansible.aws_ecr_repository_policy.policy will be created
  + resource "aws_ecr_repository_policy" "policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:DescribeRepositories",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:ListImages",
                          + "ecr:DeleteRepository",
                          + "ecr:BatchDeleteImage",
                          + "ecr:SetRepositoryPolicy",
                          + "ecr:DeleteRepositoryPolicy",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "ansible"
    }

  # module.ansible.aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:us-east-1:531133914787:task-definition/ansible:8" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu          = 0
                  - environment  = []
                  - essential    = true
                  - image        = "531133914787.dkr.ecr.us-east-1.amazonaws.com/packer-test:ansible"
                  - mountPoints  = []
                  - name         = "ansible"
                  - portMappings = []
                  - volumesFrom  = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ execution_role_arn       = "arn:aws:iam::531133914787:role/ansible_role" -> (known after apply) # forces replacement
      ~ id                       = "ansible" -> (known after apply)
      ~ revision                 = 8 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ansible.aws_iam_role.role must be replaced
-/+ resource "aws_iam_role" "role" {
      ~ arn                   = "arn:aws:iam::531133914787:role/ansible_role" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "ecs-tasks.amazonaws.com"
                        }
                        Sid       = "ECSTaskExecution"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2022-03-21T12:59:29Z" -> (known after apply)
      ~ id                    = "ansible_role" -> (known after apply)
      ~ name                  = "ansible_role" -> "ansible_ECSTaskRole" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAXXKQML2R2YME2JSTQ" -> (known after apply)
        # (4 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.endpoint_01.aws_api_gateway_integration.integration will be destroyed
  # (because aws_api_gateway_integration.integration is not in configuration)
  - resource "aws_api_gateway_integration" "integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "jdhc55" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "POST" -> null
      - id                      = "agi-e3vh22gyhl-jdhc55-POST" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "jdhc55" -> null
      - rest_api_id             = "e3vh22gyhl" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:531133914787:function:tf_lambda/invocations" -> null
    }

  # module.endpoint_01.aws_api_gateway_integration.options will be destroyed
  # (because aws_api_gateway_integration.options is not in configuration)
  - resource "aws_api_gateway_integration" "options" {
      - cache_key_parameters = [] -> null
      - cache_namespace      = "jdhc55" -> null
      - connection_type      = "INTERNET" -> null
      - http_method          = "OPTIONS" -> null
      - id                   = "agi-e3vh22gyhl-jdhc55-OPTIONS" -> null
      - passthrough_behavior = "WHEN_NO_MATCH" -> null
      - request_parameters   = {} -> null
      - request_templates    = {
          - "application/json" = jsonencode(
                {
                  - statusCode = 200
                }
            )
        } -> null
      - resource_id          = "jdhc55" -> null
      - rest_api_id          = "e3vh22gyhl" -> null
      - timeout_milliseconds = 29000 -> null
      - type                 = "MOCK" -> null
    }

  # module.endpoint_01.aws_api_gateway_integration_response.options will be destroyed
  # (because aws_api_gateway_integration_response.options is not in configuration)
  - resource "aws_api_gateway_integration_response" "options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agir-e3vh22gyhl-jdhc55-OPTIONS-200" -> null
      - resource_id         = "jdhc55" -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          - "method.response.header.Access-Control-Allow-Methods" = "'POST,OPTIONS'"
          - "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        } -> null
      - response_templates  = {} -> null
      - rest_api_id         = "e3vh22gyhl" -> null
      - status_code         = "200" -> null
    }

  # module.endpoint_01.aws_api_gateway_method.method will be destroyed
  # (because aws_api_gateway_method.method is not in configuration)
  - resource "aws_api_gateway_method" "method" {
      - api_key_required     = true -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "POST" -> null
      - id                   = "agm-e3vh22gyhl-jdhc55-POST" -> null
      - request_models       = {
          - "application/json" = "RequestModel"
        } -> null
      - request_parameters   = {
          - "method.request.header.content-type" = true
          - "method.request.header.x-api-key"    = true
          - "method.request.querystring.code"    = true
        } -> null
      - request_validator_id = "h6gjmy" -> null
      - resource_id          = "jdhc55" -> null
      - rest_api_id          = "e3vh22gyhl" -> null
    }

  # module.endpoint_01.aws_api_gateway_method.options will be destroyed
  # (because aws_api_gateway_method.options is not in configuration)
  - resource "aws_api_gateway_method" "options" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "OPTIONS" -> null
      - id                   = "agm-e3vh22gyhl-jdhc55-OPTIONS" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "jdhc55" -> null
      - rest_api_id          = "e3vh22gyhl" -> null
    }

  # module.endpoint_01.aws_api_gateway_method_response.options will be destroyed
  # (because aws_api_gateway_method_response.options is not in configuration)
  - resource "aws_api_gateway_method_response" "options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agmr-e3vh22gyhl-jdhc55-OPTIONS-200" -> null
      - resource_id         = "jdhc55" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = true
          - "method.response.header.Access-Control-Allow-Methods" = true
          - "method.response.header.Access-Control-Allow-Origin"  = true
        } -> null
      - rest_api_id         = "e3vh22gyhl" -> null
      - status_code         = "200" -> null
    }

  # module.endpoint_01.aws_api_gateway_method_response.response_200 will be destroyed
  # (because aws_api_gateway_method_response.response_200 is not in configuration)
  - resource "aws_api_gateway_method_response" "response_200" {
      - http_method         = "POST" -> null
      - id                  = "agmr-e3vh22gyhl-jdhc55-POST-200" -> null
      - resource_id         = "jdhc55" -> null
      - response_models     = {} -> null
      - response_parameters = {} -> null
      - rest_api_id         = "e3vh22gyhl" -> null
      - status_code         = "200" -> null
    }

  # module.endpoint_01.aws_api_gateway_model.model will be destroyed
  # (because aws_api_gateway_model.model is not in configuration)
  - resource "aws_api_gateway_model" "model" {
      - content_type = "application/json" -> null
      - description  = "Request schema model." -> null
      - id           = "qwfsgs" -> null
      - name         = "RequestModel" -> null
      - rest_api_id  = "e3vh22gyhl" -> null
      - schema       = jsonencode(
            {
              - $schema              = "http://json-schema.org/draft-04/schema#"
              - additionalProperties = false
              - properties           = {
                  - myname = {
                      - type = "string"
                    }
                }
              - required             = [
                  - "myname",
                ]
              - title                = "UserModel"
              - type                 = "object"
            }
        ) -> null
    }

  # module.endpoint_01.aws_api_gateway_resource.resource will be destroyed
  # (because aws_api_gateway_resource.resource is not in configuration)
  - resource "aws_api_gateway_resource" "resource" {
      - id          = "jdhc55" -> null
      - parent_id   = "08263f8zuc" -> null
      - path        = "/event" -> null
      - path_part   = "event" -> null
      - rest_api_id = "e3vh22gyhl" -> null
    }

  # module.endpoint_01.aws_iam_role.iam_for_lambda will be destroyed
  # (because aws_iam_role.iam_for_lambda is not in configuration)
  - resource "aws_iam_role" "iam_for_lambda" {
      - arn                   = "arn:aws:iam::531133914787:role/tf_lambda_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-01-10T05:03:59Z" -> null
      - force_detach_policies = false -> null
      - id                    = "tf_lambda_role" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "tf_lambda_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAXXKQML2RQL7OY6WY6" -> null

      - inline_policy {}
    }

  # module.endpoint_01.aws_lambda_function.function will be destroyed
  # (because aws_lambda_function.function is not in configuration)
  - resource "aws_lambda_function" "function" {
      - architectures                  = [
          - "arm64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:531133914787:function:tf_lambda" -> null
      - description                    = "Application security demo, deployed by Terraform." -> null
      - filename                       = "./modules/security_demo_endpoint/resources/lambda_function.zip" -> null
      - function_name                  = "tf_lambda" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "tf_lambda" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:531133914787:function:tf_lambda/invocations" -> null
      - last_modified                  = "2022-01-19T04:17:17.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:531133914787:function:tf_lambda:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::531133914787:role/tf_lambda_role" -> null
      - runtime                        = "python3.9" -> null
      - source_code_hash               = "dclCGdtuSmLhltdxqzmQqGVMhlCT0rosLPp7WcdVfp0=" -> null
      - source_code_size               = 621 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "CORS"     = "*"
              - "ENCODING" = "latin-1"
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.endpoint_01.aws_lambda_permission.apigw_lambda will be destroyed
  # (because aws_lambda_permission.apigw_lambda is not in configuration)
  - resource "aws_lambda_permission" "apigw_lambda" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "tf_lambda" -> null
      - id            = "AllowExecutionFromAPIGateway" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - source_arn    = "arn:aws:execute-api:us-east-1:531133914787:e3vh22gyhl/*/POST/event" -> null
      - statement_id  = "AllowExecutionFromAPIGateway" -> null
    }

  # module.security_demo.aws_api_gateway_api_key.api_key will be destroyed
  # (because aws_api_gateway_api_key.api_key is not in configuration)
  - resource "aws_api_gateway_api_key" "api_key" {
      - arn               = "arn:aws:apigateway:us-east-1::/apikeys/vo9krzvmif" -> null
      - created_date      = "2022-01-10T05:03:59Z" -> null
      - description       = "Managed by Terraform" -> null
      - enabled           = true -> null
      - id                = "vo9krzvmif" -> null
      - last_updated_date = "2022-01-10T05:03:59Z" -> null
      - name              = "my_api_key" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
      - value             = (sensitive value)
    }

  # module.security_demo.aws_api_gateway_deployment.deployment will be destroyed
  # (because aws_api_gateway_deployment.deployment is not in configuration)
  - resource "aws_api_gateway_deployment" "deployment" {
      - created_date  = "2022-03-18T03:48:02Z" -> null
      - execution_arn = "arn:aws:execute-api:us-east-1:531133914787:e3vh22gyhl/test" -> null
      - id            = "jtgcfv" -> null
      - invoke_url    = "https://e3vh22gyhl.execute-api.us-east-1.amazonaws.com/test" -> null
      - rest_api_id   = "e3vh22gyhl" -> null
      - stage_name    = "test" -> null
      - triggers      = {
          - "redeployment" = "879bef1b9da7509ea1861d6c6ddc6d6a536f3c5f"
        } -> null
    }

  # module.security_demo.aws_api_gateway_integration.options will be destroyed
  # (because aws_api_gateway_integration.options is not in configuration)
  - resource "aws_api_gateway_integration" "options" {
      - cache_key_parameters = [] -> null
      - cache_namespace      = "08263f8zuc" -> null
      - connection_type      = "INTERNET" -> null
      - http_method          = "OPTIONS" -> null
      - id                   = "agi-e3vh22gyhl-08263f8zuc-OPTIONS" -> null
      - passthrough_behavior = "WHEN_NO_MATCH" -> null
      - request_parameters   = {} -> null
      - request_templates    = {
          - "application/json" = jsonencode(
                {
                  - statusCode = 200
                }
            )
        } -> null
      - resource_id          = "08263f8zuc" -> null
      - rest_api_id          = "e3vh22gyhl" -> null
      - timeout_milliseconds = 29000 -> null
      - type                 = "MOCK" -> null
    }

  # module.security_demo.aws_api_gateway_integration_response.options will be destroyed
  # (because aws_api_gateway_integration_response.options is not in configuration)
  - resource "aws_api_gateway_integration_response" "options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agir-e3vh22gyhl-08263f8zuc-OPTIONS-200" -> null
      - resource_id         = "08263f8zuc" -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          - "method.response.header.Access-Control-Allow-Methods" = "'POST,OPTIONS'"
          - "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        } -> null
      - response_templates  = {} -> null
      - rest_api_id         = "e3vh22gyhl" -> null
      - status_code         = "200" -> null
    }

  # module.security_demo.aws_api_gateway_method.options will be destroyed
  # (because aws_api_gateway_method.options is not in configuration)
  - resource "aws_api_gateway_method" "options" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "OPTIONS" -> null
      - id                   = "agm-e3vh22gyhl-08263f8zuc-OPTIONS" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "08263f8zuc" -> null
      - rest_api_id          = "e3vh22gyhl" -> null
    }

  # module.security_demo.aws_api_gateway_method_response.options will be destroyed
  # (because aws_api_gateway_method_response.options is not in configuration)
  - resource "aws_api_gateway_method_response" "options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agmr-e3vh22gyhl-08263f8zuc-OPTIONS-200" -> null
      - resource_id         = "08263f8zuc" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = true
          - "method.response.header.Access-Control-Allow-Methods" = true
          - "method.response.header.Access-Control-Allow-Origin"  = true
        } -> null
      - rest_api_id         = "e3vh22gyhl" -> null
      - status_code         = "200" -> null
    }

  # module.security_demo.aws_api_gateway_method_settings.all will be destroyed
  # (because aws_api_gateway_method_settings.all is not in configuration)
  - resource "aws_api_gateway_method_settings" "all" {
      - id          = "e3vh22gyhl-test-*/*" -> null
      - method_path = "*/*" -> null
      - rest_api_id = "e3vh22gyhl" -> null
      - stage_name  = "test" -> null

      - settings {
          - cache_data_encrypted                       = false -> null
          - cache_ttl_in_seconds                       = 300 -> null
          - caching_enabled                            = false -> null
          - data_trace_enabled                         = false -> null
          - logging_level                              = "OFF" -> null
          - metrics_enabled                            = false -> null
          - require_authorization_for_cache_control    = true -> null
          - throttling_burst_limit                     = 500 -> null
          - throttling_rate_limit                      = 1000 -> null
          - unauthorized_cache_control_header_strategy = "SUCCEED_WITH_RESPONSE_HEADER" -> null
        }
    }

  # module.security_demo.aws_api_gateway_request_validator.validator will be destroyed
  # (because aws_api_gateway_request_validator.validator is not in configuration)
  - resource "aws_api_gateway_request_validator" "validator" {
      - id                          = "h6gjmy" -> null
      - name                        = "validator" -> null
      - rest_api_id                 = "e3vh22gyhl" -> null
      - validate_request_body       = true -> null
      - validate_request_parameters = true -> null
    }

  # module.security_demo.aws_api_gateway_rest_api.api will be destroyed
  # (because aws_api_gateway_rest_api.api is not in configuration)
  - resource "aws_api_gateway_rest_api" "api" {
      - api_key_source               = "HEADER" -> null
      - arn                          = "arn:aws:apigateway:us-east-1::/restapis/e3vh22gyhl" -> null
      - binary_media_types           = [] -> null
      - created_date                 = "2022-01-10T05:03:59Z" -> null
      - description                  = "Application security demo, deployed by Terraform." -> null
      - disable_execute_api_endpoint = false -> null
      - execution_arn                = "arn:aws:execute-api:us-east-1:531133914787:e3vh22gyhl" -> null
      - id                           = "e3vh22gyhl" -> null
      - minimum_compression_size     = -1 -> null
      - name                         = "tf_api" -> null
      - root_resource_id             = "08263f8zuc" -> null
      - tags                         = {} -> null
      - tags_all                     = {} -> null

      - endpoint_configuration {
          - types            = [
              - "REGIONAL",
            ] -> null
          - vpc_endpoint_ids = [] -> null
        }
    }

  # module.security_demo.aws_api_gateway_usage_plan.usage_plan will be destroyed
  # (because aws_api_gateway_usage_plan.usage_plan is not in configuration)
  - resource "aws_api_gateway_usage_plan" "usage_plan" {
      - arn         = "arn:aws:apigateway:us-east-1::/usageplans/9zgd89" -> null
      - description = "API usage plan." -> null
      - id          = "9zgd89" -> null
      - name        = "my_usage_plan" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null

      - api_stages {
          - api_id = "e3vh22gyhl" -> null
          - stage  = "test" -> null
        }

      - quota_settings {
          - limit  = 10000 -> null
          - offset = 0 -> null
          - period = "MONTH" -> null
        }

      - throttle_settings {
          - burst_limit = 500 -> null
          - rate_limit  = 1000 -> null
        }
    }

  # module.security_demo.aws_api_gateway_usage_plan_key.plan_key will be destroyed
  # (because aws_api_gateway_usage_plan_key.plan_key is not in configuration)
  - resource "aws_api_gateway_usage_plan_key" "plan_key" {
      - id            = "vo9krzvmif" -> null
      - key_id        = "vo9krzvmif" -> null
      - key_type      = "API_KEY" -> null
      - name          = "my_api_key" -> null
      - usage_plan_id = "9zgd89" -> null
      - value         = "iMzRvoZoVu8mmnXcnmch8sbYPKmJihi4u3D5pbR6" -> null
    }

  # module.security_demo.aws_wafv2_web_acl.waf_regional will be destroyed
  # (because aws_wafv2_web_acl.waf_regional is not in configuration)
  - resource "aws_wafv2_web_acl" "waf_regional" {
      - arn         = "arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL_Regional/3d32b9d4-53a4-431a-b6af-53ae33d291dd" -> null
      - capacity    = 925 -> null
      - description = "Standard WebACL for API Gateway, TerraForm deploy." -> null
      - id          = "3d32b9d4-53a4-431a-b6af-53ae33d291dd" -> null
      - lock_token  = "68294d6a-0b39-4651-bfc8-283642fce29a" -> null
      - name        = "StandardACL_Regional" -> null
      - scope       = "REGIONAL" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null

      - default_action {
          - allow {
            }
        }

      - rule {
          - name     = "AWSManagedRulesAmazonIpReputation" -> null
          - priority = 2 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = false -> null
              - metric_name                = "AWSManagedRulesAmazonIpReputation" -> null
              - sampled_requests_enabled   = false -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesCommonRule" -> null
          - priority = 0 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesCommonRuleSet" -> null
                  - vendor_name = "AWS" -> null

                  - excluded_rule {
                      - name = "GenericRFI_QUERYARGUMENTS" -> null
                    }
                  - excluded_rule {
                      - name = "GenericRFI_BODY" -> null
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = false -> null
              - metric_name                = "AWSManagedRulesCommonRule" -> null
              - sampled_requests_enabled   = false -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesKnownBadInputsRule" -> null
          - priority = 1 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = false -> null
              - metric_name                = "AWSManagedRulesKnownBadInputsRule" -> null
              - sampled_requests_enabled   = false -> null
            }
        }

      - visibility_config {
          - cloudwatch_metrics_enabled = false -> null
          - metric_name                = "StandardACL" -> null
          - sampled_requests_enabled   = false -> null
        }
    }

  # module.security_demo.aws_wafv2_web_acl_association.waf_association will be destroyed
  # (because aws_wafv2_web_acl_association.waf_association is not in configuration)
  - resource "aws_wafv2_web_acl_association" "waf_association" {
      - id           = "arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL_Regional/3d32b9d4-53a4-431a-b6af-53ae33d291dd,arn:aws:apigateway:us-east-1::/restapis/e3vh22gyhl/stages/test" -> null
      - resource_arn = "arn:aws:apigateway:us-east-1::/restapis/e3vh22gyhl/stages/test" -> null
      - web_acl_arn  = "arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL_Regional/3d32b9d4-53a4-431a-b6af-53ae33d291dd" -> null
    }

Plan: 5 to add, 0 to change, 27 to destroy.

Changes to Outputs:
  - ansible_task    = "aws ecs run-task --cluster ansible --launch-type FARGATE --task-definition arn:aws:ecs:us-east-1:531133914787:task-definition/ansible:8 --network-configuration 'awsvpcConfiguration={subnets=[subnet-072107252df3c7e87,subnet-03b71dab2f9a1bb6f],securityGroups=[sg-05bd0031419bb91c5],assignPublicIp=ENABLED}'" -> null
  - endpoint_01_url = "https://e3vh22gyhl.execute-api.us-east-1.amazonaws.com/test/event" -> null

```

</details>

*Pusher: @fer1035, Action: `pull_request`*